{
  "id": "00004",
  "text": "Use this exact prompt in GitHub Copilot to add two features to the frontend\r\n\r\nFeature one\r\nFix the textarea full page layout so large text scrolls inside the box and never disappears behind the outline or page footer\r\n\r\nFeature two\r\nAdd a theme toggle at the top right to switch between dark and light theme and remember the choice across reloads\r\n\r\nApply changes to these files only\r\nweb/index.html\r\nweb/view.html\r\nweb/style.css\r\nweb/app.js\r\n\r\nRequirements for the generator\r\n\r\nMake minimal changes to existing markup and scripts\r\n\r\nKeep styles small and use CSS variables for colors\r\n\r\nUse a top right button labeled Theme to toggle\r\n\r\nPersist theme selection in localStorage key pasteTheme\r\n\r\nEnsure textarea uses box sizing border box and its height is computed so it does not overflow past the visible container\r\n\r\nTextarea must scroll internally when content exceeds visible area\r\n\r\nProvide smooth transition between themes\r\n\r\nDo not add any external libraries\r\n\r\nEnsure mobile friendly layout and keyboard usability\r\n\r\nExact tasks to implement\r\n\r\nA. HTML changes for index and view pages\r\n\r\nAdd a header element at the top with two items\r\na. Left aligned title element Minimal Paste Service unchanged\r\nb. Right aligned button with id themeToggle and text Theme\r\n\r\nWrap the large textarea and the Go button in a main container with class editorContainer so CSS can size it\r\n\r\nEnsure textarea has id pasteInput and the Go button has id goButton so existing JS continues to work\r\n\r\nB. CSS changes in web slash style dot css\r\n\r\nDefine CSS variables under :root for the light theme and inside body dot darkTheme override them for dark mode\r\nExample variables\r\ncolorBackground\r\ncolorSurface\r\ncolorText\r\ncolorAccent\r\ncolorBorder\r\n\r\nSet global styles\r\nbox sizing border box on all elements\r\nuse system stack font family\r\n\r\nHeader styling\r\nfixed or sticky top header with height 64px full width and internal padding\r\ntitle left and theme button right aligned with gap\r\n\r\nEditor container sizing\r\nplace below the header\r\ncompute height using calc so it fills available viewport space\r\nFor example height calc 100vh minus 64px minus 48px where 64px is header height and 48px is footer area if any\r\nuse overflow hidden on the container\r\n\r\nTextarea specific rules\r\nwidth 100 percent minus container padding\r\nheight 100 percent of container minus Go button area using flex layout\r\nset resize none\r\noverflow auto so long text scrolls inside the textarea\r\nset padding large enough so text does not touch the outline\r\nborder radius and border using colorBorder variable\r\n\r\nGo bu",
  "timestamp": 1763094697030,
  "version": 1
}